{
	"version": "https://jsonfeed.org/version/1",
	"title": "Patrick McConnell",
	"icon": "https://micro.blog/pmcconnell/avatar.jpg",
	"home_page_url": "https://pmcconnell.micro.blog/",
	"feed_url": "https://pmcconnell.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://pmcconnell.micro.blog/2023/09/29/it-should-not.html",
				"title": "It Should Not Be So Difficult To Be So Thick Headed",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>As a long time proponent of avoiding dependencies in my software projects, it's often incredibly frustrating trying to find out how to do something yourself when that market has been taken over by services that really, really just want you to use their paid tools. Even the “open\" and “free\" paths can lead to dead ends in some SAAS product.</p>\n<p>I’ve been working on some map based products/apps for a long while. While the map frameworks available on the various platforms such as iOS and Android are good, I do need to extend what they are capable of. Things like offline viewing of a map or custom appearances (such as topography) are just not available out of the box in these frameworks.</p>\n<p>I am well aware of the steps required to render custom map tiles as I’ve done it in the past. Nowadays it seems like a wall has been thrown up around the tools and info needed to accomplish these sorts of tasks. I can find all sorts of documentation on how to generate the custom images necessary for offline map viewing or styling of my maps but inevitably at some point in my reading the path will lead to some paid tool/service.</p>\n<p>These services are free to market themselves and charge for what they are offering. I’m not suggesting there is anything wrong with that. I’m sure it helps many people accomplish things quickly and “easily” however I prefer not to rely on others. I’ve seen enough in the past to want to control as much of my code as possible. I just prefer to do things myself whenever possible.</p>\n<p>In the case of mapping tools I believe at some point in the past many these tools were freely available and widely known.  Somewhere along the line, the tools were put behind a pay wall and the ladder pulled up so that thick skulled fools such as myself have to really dig to find out how to do this themselves.</p>\n<p>I think on a more broad level this is similar to many things that used to be freely available but have now converted to a subscription. At some point we’re going to be paying for breathable air, aren’t we? </p>\n",
				"date_published": "2023-09-29T10:45:02-04:00",
				"url": "https://pmcconnell.micro.blog/2023/09/29/it-should-not.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/08/30/not-really-a.html",
				"title": "Not Really a Review of My New E-bike",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>This is ostensibly a review of an electric bike, the <a href=\"https://www.cannondale.com/en-us/bikes/electric/e-touring/tesoro-neo-x/tesoro-neo-x-3-smu\">Cannondale Tesoro Neo X3</a></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"C21_C66421M_Tesoro_Neo_X_BLK_PD.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/c21-c66421m-tesoro-neo-x-blk-pd.png\" alt=\"C21 C66421M Tesoro Neo X BLK PD\" width=\"599\" height=\"329\" border=\"0\" /></p>\n<p>tl;dr: It’s a great bike. It should be as it costs a lot of money.</p>\n<p>The real story is what e-bikes do for you. </p>\n<p>Prior to getting my new Cannondale I had only ridden one other e-bike before. It was a very brief ride down a short driveway into the road and back after which I dismounted and returned the bike to its owner. That bike, of no specific brand, was a folding bike with 16” wheels and a throttle. It was fast. It was jerky. It felt dangerous. I’m not slagging on that sort of bike. I’m sure they have their uses and like any tool, when used responsibly you can get good results with it.</p>\n<p>I am also reasonably certain that all the media panic recently about e-bikes relates to these sorts of bikes and people not being as responsible on them as they might otherwise be. Mostly I think that hype is just nonsense in general. Yes, bike batteries can catch fire. Know what else catches fire? Cars, Phones, Computers and other things with lithium ion batteries.  If you buy a product that seems a bit cheaper than some of the other options in that market you might expect some corners were cut but beyond that shit happens. Do some users of e-bikes ride recklessly? Most certainly. Do pickup trucks the size of city blocks sometimes come too close to me on the road? All too often. Sure let’s get out the pitchforks for e-bikes just as they might start to cut into our over dependence on cars and the minor impact those cars are having on out planet. I’m certain bikes are the appropriate target right now.</p>\n<p>Anyway...</p>\n<p>As I said above this is a great bike and it costs a bunch of money. Money I never would have spent had I not had a substantial discount with Cannondale due to a warranty claim from an old bike. I did not pay retail for this bike. Prior to getting this new ride I thought I might get an e-bike one day as I’m getting older and I suffer from knee pain on the bike from time to time. However while looking at the Cannondale catalog it soon became clear that now was as good a time as any to get into e-biking.</p>\n<p>As a lifelong cyclist I fought mental battles with myself over how I’m not that old and don’t need a bike to “cheat\" on my rides. For the record, I’ve never accused anyone I see out riding an e-bike of cheating. In fact I often say to my wife that it’s better than them driving or just sitting on the couch. When it was time for me to consider an e-bike I was much harder on myself than necessary. I already have 3 other bikes that all see use for different types of riding. Besides raging against aging my fear was I may not ride those other bikes as much as before.  My knee pains won out and I ordered the Tesoro.</p>\n<p>You can get the bike specifications on the Cannondale site and I’m sure you can find other much more technical reviews elsewhere. The bike has a Bosch drivetrain and a mid drive motor. For those unaware there are two general types of drives, mid drive and hub drive. Mid drive features a motor directly attached to the cranks while a hub drive is in the wheel. I only have limited experience here but all signs point to the mid drive being smoother and more natural feeling. I’m certain that you can spend enough to get an excellent hub drive e-bike.</p>\n<p>This bike has a mid drive and it is smooth once you get used to it. I’m not even sure “smooth” is the right word. There is a unnatural sensation readily apparent to long time cyclists on that first e-bike ride. It’s a sensation that arises from putting in the effort that you would expect to result in your speedometer reading 12 MPH but seeing 16MPH. It’s the difference in mashing the pedals to get up a hill at 5 MPH and continuing to spin the pedals lightly and scaling the hill at 12 MPH. That uncanny sensation passes after the first few miles and quickly gets you thinking where can I go with this? How far will it take me? Can I finally see what’s down that road I always avoid due to the steep grade. Thus far my answers have all be in the positive.</p>\n<p>After a few weeks, I have a little over 200 miles on the bike. I typically rode 20 mile rides on a steel touring bike prior to getting the Tesoro. I am the sort of rider out there in a button down shirt and my regular hiking/walking shorts. I don’t don the lycra. I’m not racing. I’m riding out of my driveway and seeing what’s out there. I go slow. I derive joy from following some new road, not how fast I did my route. Nothing wrong with lycra or going fast but that’s not me. This bike opens up new possibilities for me. I am getting older and I do resist more strenuous rides from time to time.</p>\n<p>I am always curious what’s up that hill (and there are lots of rural hilly roads near me) From the first ride on this new bike I have just said “sure” every time I asked myself “should I see what’s up that road?” The bike will help me and I won’t suffer uphill or into the wind. My rides are now closer to 30 miles on average. I’m still pedaling, sweating and burning calories. Just going a little faster and a little farther with about the same effort as before.</p>\n<p>E-biking for me has been about giving me more me. I could always get up the hills or do 40 miles into the wind. I have done those things many times. Now I can do those same things easier. The bike has 4 settings for assist, eco, touring, sport and turbo. None of them allow you to stop pedaling. They just increase how much help you get from the motor (and how quickly the battery will drain and thus your range) As I mentioned I am a slow and steady, see what’s out there rider so I mostly stick to eco mode. I still do most of the work. I go a bit faster for the same effort. I don’t care about the speed increase at all. Sure it’s fun to pop it into turbo mode and quickly speed up to over 20 MPH but to me that is not why I bike so it’s a minor feature (and it eats battery)</p>\n<p>I’ve found the advertised range to be accurate. The bike is rated to go 80 miles on a charge. While I have not yet done a single ride of that length I have done 40+ mile rides and still had more than half the battery. On most of my rides I mainly use the eco setting for minimal assist and maximum range but I am frequently popping into the higher levels of assist if only to climb a hill or overcome some other obstacle. I suspect I could get 90+ miles with my usage.</p>\n<p>The quality of the bike is good. The key components are excellent such as the Bosch drivetrain and the frame. The gears and brakes seem adequate. They work fine but I suspect if you were on a regular bike you might prefer a better derailleur for example. The control/computer screen is adequate. I only say this as my wife recently got a Specialized Como that has a better computer than the Cannondale. The Cannondale does not support any apps nor is it a color screen. It does do what it needs to do in a clear way and that’s good enough. My wife’s bike computer doesn’t have any features I miss with the possible exception of interfacing with apps. Not important.</p>\n<p>A big plus for me is how this bike is accessorized. It features front and rear lights, a rack, bell and fenders. If you’re the type of rider who rides a fender bike you know why this is important to you. You can ride in most any conditions and not come home covered in mud or wet. The fenders are large to cover the giant tires. They are solid but tend to make a bunch of noise in combination with the tires picking up gravel, etc and sending it in a trip around the fender. All fenders do this but these seem louder or more prone to it. Not a complaint but rather an observation.</p>\n<p>Part of my justification for getting this e-bike was to take even more load off my Subaru. I already use my other bikes to run local errands but I hope to use this bike to go farther afield where I might have used the car in the past. Having said that in the first few weeks I’ve own the Cannondale I’ve reverted back to my other bikes to run all bike ranged errands. My grocery store is less than a mile away and I could walk. I don’t need a $3k+ bike to get there. I do live very close to an excellent bike trail that runs between two cities we frequent for errands and dining. I envision using the e-bikes to do the 25 mile round trip while not being concerned about post meal bloat slowing us down.</p>\n<p>If you’re thinking I want to do no work and “ride a bike” this is not that bike. There are bikes with throttles that allow you to just sit, press the throttle and get where you’re going.</p>\n<p>This is a heavy bike. You could ride it with no assist if necessary but it’s not ideal. In eco mode it feels like the assist gets you over the heft of the bike and a bit more. The other assist levels make the bike feel lighter and faster and at the highest level you are in electric motorcycle territory. In turbo mode a minimal amount of input will get you up the gnarliest hill and quickly have you speeding along at 25+ MPH. Your range will also drop down quite a lot. If you only need to go a few miles it might be fun to zip around in the higher assist levels. I prefer to save the battery to cover more ground.</p>\n<p>So yeah, this is not really a review of the Cannondale Tesoro Neo X3. It’s a review of what an e-bike can do for your life. They allow you to do more. If you previously didn’t ride at all you might find an e-bike gets you out riding. If you typically ride 10 mile routes you might up that to 20 on the e-bike. If you have knee pain, like me, you might be able to take some of the load off and continue to enjoy your rides. If you often take a 10+ mile ride somewhere and think it might be nice to have some food and drinks but decide against it considering the ride home you might get enough assistance from the bike to make that a less of a burden. If you’ve been riding around your neighborhood for years and have yet to see what’s up that road with the 10% grade you might just cruise up there and see.</p>\n<p>The best feature of any e-bike is it allows you to regain some of that joy you felt as a kid with your first bike. That sense of freedom that all bikes bring is a little easier to achieve on an e-bike. Sure it can be a cargo hauling, commuting to work tool but most importantly it’s just plain fun.</p>\n",
				"date_published": "2023-08-30T08:47:12-04:00",
				"url": "https://pmcconnell.micro.blog/2023/08/30/not-really-a.html",
				"tags": ["Bikes"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/08/29/sometimes-it-still.html",
				"title": "Sometimes It Still \"Just Works\"",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>From the department of little things that (still) make for quality apps…</p>\n<p>I'm currently working on a Go API for a new product we’re working on at <a href=\"https://squirrelpointstudios.com\">Squirrel Point Studios</a>. My current editor of choice is <a href=\"https://nova.app/\">Nova</a> by <a href=\"https://panic.com/\">Panic.</a> I have the app configured to allow me to run the app and tests in several ways right in the editor. I’m a fan of turning my editors into an <a href=\"https://en.wikipedia.org/wiki/Integrated_development_environment\">IDE</a> when possible.</p>\n<p>I like accomplishing as many parts of the development process in one app. Nova delivers on this in much the same way as something like <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a>. Sure there is a smaller audience and thus a smaller extension library but this doesn’t mean you can’t do the same things. There may only be 2-3 Go extensions vs 100 that might exist in the other editor but you can get what you want done.</p>\n<p>I’ve used VS Code for years and it’s probably the best example of an <a href=\"https://www.electronjs.org/\">Electron app</a> there is but it’s not a native app and never will be. I’ve built Electron apps when it served the purpose at hand. It has its benefits but native is almost always better unless you’re looking to cut some corner (expense.) More correctly, native apps have more upside than other solutions. Not all native apps live up to what is possible but some do and it’s worth seeking them out.</p>\n<p>One of the side effects of using Nova as an IDE (and why I started this whole brain dump…) is you can end up with several tabs of output from various actions. I tend to keep these tabs in a pane at the bottom of the editor view, as shown here. </p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"Screenshot 2023-08-29 at 14.58.03.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/screenshot-2023-08-29-at-14.58.03.png\" alt=\"Screenshot 2023 08 29 at 14 58 03\" width=\"599\" height=\"558\" border=\"0\" /></p>\n<p>Today I closed all my source code files to start on a new feature leaving only the report tabs open. My OCD causes me to need these panels to appear in the bottom of the editor. In one of those “it just works\" moments that have become more infrequent over time, I right clicked on a report tab that I had moved to the lower pane and in the menu that appeared there is an option for “Move All Report Tabs To This Pane.” This was unexpected and very welcome. Sure I could have just dragged the handful of tabs to the lower pane but someone at Panic thought this might be helpful and took the time to add this feature. I salute that person and all the folks at shops like Panic that still care enough to add these little touches that are probably missed by 90% of users.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"Screenshot 2023-08-29 at 14.59.36.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/screenshot-2023-08-29-at-14.59.36.png\" alt=\"Screenshot 2023 08 29 at 14 59 36\" width=\"366\" height=\"260\" border=\"0\" /></p>\n<p>I remember when I first started using a Mac full time around the time of OS X 10.1. Those early days were full of little moments where you would just try things to see if they worked and very often they did. As MacOS has matured and more so as web apps have displaced native applications we see less and less of these little bits of forethought that reveal themselves as “magic.”</p>\n<p>I think these little touches should be part of the spec for <a href=\"https://collindonnell.com\">Mac-assed Apps, a term coined by Collin Donnell </a> that I learned about via this post from <a href=\"https://inessential.com/2020/03/19/proxyman\">Brent Simmons</a>. This sort of thing is why I continue to fight the battle against web apps and universal frameworks. Sure, there are good examples but a conservative estimate might be 1:1,000 good vs adequate applications. Those of us who understand this are still out here using old school apps like <a href=\"https://www.barebones.com/products/bbedit/\">BBEdit</a> and new fangled examples like <a href=\"https://nova.app/\">Nova</a>. We resist the temptation of the new shiny thing everyone else is using because these Mac-assed apps do the job and often do it better if you just give them a chance.</p>\n",
				"date_published": "2023-08-29T15:36:34-04:00",
				"url": "https://pmcconnell.micro.blog/2023/08/29/sometimes-it-still.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/06/08/hey-i-have.html",
				"title": "Hey I have a WWDC Post Too!!?!",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Everyone else is doing it so here is my post on WWDC.</p>\n<p>As a long time Apple developer I have always followed the events of WWDC. Some years I am working in other areas and I don’t follow as closely as others. This year I am in the middle of a few projects for iPhone/iPad/Mac so I was watching intently for things I could use. </p>\n<p>I’ve done this long enough that I know that anything announced can’t be used for at least a few month until the new frameworks and platform updates are released. When doing consulting work I am usually required to support a few older OS versions so even after the frameworks are released they are often not available to use. On my own personal projects I will jump in and require the latest OS if it’s compelling enough. Apple device users tend to update quickly and my philosophy is that people who don’t update are probably not a large group of app buyers anyway.</p>\n<p>Right now I am working on several mapping app projects (<a href=\"https://peakist.app\">Peakist</a> being one.) I prefer to work in SwiftUI when possible as it’s just easier when it does what you need. I am comfortable falling back to using UIKit when needed but it is cumbersome so I was hoping for improvements to MapKit with SwiftUI. I dared not actively wish for this as Apple moves very slowly and rarely gives you what you want in a timely fashion. I was very happily surprised when the keynote mentioned MapKit related items like offline maps and topographic map styles. However, when I went to bed that night thinking of how I would refactor my apps to use these new things it dawned on me that perhaps Apple didn’t expose these features to developers. The next morning I dug into the docs and videos and my fears were correct. While Apple has given Map app itself the ability to download maps for offline use there is no public framework for developers to do so. More frustrating, personally, the topo map style is not available outside Apple’s own use for the Map app on the watch.</p>\n<p>Still the improvements to MapKit with SwiftUI for non-topo map projects are compelling. In some quick experiments I was able to replace my UIKit map bridge containing 100s of lines of code with a handful of lines of SwiftUI code. That’s a huge win and I will use this for future projects.</p>\n<p>All the other improvements to the platforms look great as well. I haven’t dug into what is and isn’t accessible for developers but I’ll get there when I need some new features.</p>\n<p>The headset looks like impressive technology but I think Gruber eloquently summed up what I was thinking when he talked about whether it makes a “<a href=\"https://daringfireball.net/2023/06/first_impressions_of_vision_pro_and_visionos\">compelling product</a>” It looks like an amazing toy at a minimum and I would like to try it but I don’t see a reason to buy it. <strong><em>Yet</em></strong>.</p>\n<p>If it was under $1k I might feel differently but the current price is too high for something that I feel currently has limited use. I’m not saying it’s too expensive for what it is. Sure there is an Apple premium I suppose but it’s just more costly than I can justify to play with. This is all likely to change once use cases emerge and more software is available. I suspect this will be similar to the watch where apple tossed out all sorts of ideas at launch and it eventually settled into a fitness/notification device. </p>\n<p>I’ve yet to use a VR headset that doesn’t quickly make me nauseous so I most defiantly would not purchase one without trying it. I sounds like some of the things they have done here will help with that but time will tell.</p>\n<p>I think it’s clear from many of the improvements and new frameworks that Apple is increasing their dogfood-ing of SwiftUI. Things many of us have asked for are being added and they look like great implementations. I’m sure holes remain, and I’ve found a few myself, but things are improving. </p>\n<p>The big win for me this week has been <a href=\"https://mastodon.social/@patrickmcconnell\">Mastodon</a> and finding more interesting people to interact with. I’ve had great conversations with people working in the same areas as me and look forward to continuing discussions in the future.</p>\n<p>Sure there are the usual negative borderline trolls abusing the #wwdc hashtag but for the most part it’s been a very positive experience. I do understand some of the concerns about the walled garden, patent locked software, climate change and how many animals were harmed in the production of this toy for the rich and powerful. I get it but this is still impressive technology and let us just geek out for a bit. For some of the concern trolls I offer the words of the dude:</p>\n<p><img title=\"Fo-FtF-X0AAo1SS.jpg\" src=\"https://cdn.uploads.micro.blog/1998/2023/a8f60f1e03.jpg\" alt=\"Fo FtF X0AAo1SS\" width=\"259\" height=\"258\" border=\"0\" /></p>\n<p>So as the WWDC week winds down, I’m watching the videos and reading the docs longing for the time when I can make use of the new tools. Right now I have to ship a few things so I need to suppress my immediate disappointments with missing features and the lack of ability to use what is provided in beta frameworks. Still it’s inspiring to see the new things coming and I continue on with current projects with a bit more enthusiasm.</p>\n",
				"date_published": "2023-06-08T10:11:27-04:00",
				"url": "https://pmcconnell.micro.blog/2023/06/08/hey-i-have.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/05/03/creating-a-swiftui.html",
				"title": "Creating a SwiftUI Launch Screen",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><strong>Some Background</strong></p>\n<p>iOS and iPadOS apps both support a launch screen that will be shown first when the app launches. The purpose of the launch screen is to indicate the app has launched but it may still be doing some background tasks or unwrapping the UI before it’s ready for the user. It’s traditional to show a splash screen or an image of your actual UI for the launch screen. This makes the app feel responsive and the device feel fast. This has always been a bit of an Apple sponsored hack to make things feel smooth and quick for users. It works.</p>\n<p>The old way of creating a launch screen is by defining a view in a storyboard and pointing Xcode to that view. That view might be just a UIImage or it could be any view you like. This worked fine in the days of UIKit where you may have already created the UI views in a storyboard so you could easily replicate your UI view as a launch screen in order to make it appear the app was loading quickly. </p>\n<p>In the days of SwiftUI where many things remain in flux, there are new ways to create launch screens. You can still use the older method but it’s more difficult to create a view that matches the view you dynamically generate in your SwiftUI code. </p>\n<p>In my current app my initial view is displaying a circular image close to the center of the screen and that image is magically sized in my SwiftUI code to best fit the screen. There are several other text elements displayed and I don’t do much more to place them then drop them all in a VStack and using some spacers. Replicating that magic in a UIView from a storyboard is difficult and some things may in fact not be possible. In order to come up with something that didn’t create a jarring transition from launch to live UI I needed a solution.</p>\n<p>The newer method of creating launch screens is to specify some values in your info.plist file and let the compiler build a launch screen for you. Unfortunately you can only pick a background color and image to be shown along with options to display navigation items such as a navigation bar or a tab bar. This method may work if you just want a splash screen shown before the real UI but for other usage it’s not great.</p>\n<p>My app starts by displaying a full view loading screen so using a splash screen that transitions to what amounts to another splash screen before the actual UI seemed like a bad idea.</p>\n<p>I started by trying to mimic the loading view in UIKit to appear that the loading view was displayed immediately upon launch but I quickly tired of setting constraints and trying for pixel perfection between UIKit and SwiftUI. I spent some time thinking it over and thought what if I didn’t use a launch screen at all? Up until this point in the development cycle this was how the app was working and it wasn’t awful but it also lacked a bit of the polish you like to see in a finished product.</p>\n<p>When my app launches the first thing it needs to do is query an API for data updates. I initially display a loading view to indicate to the user that something is happening before we can present any data. In my current app this loading screen is a full screen view and that works well with this solution I’m presenting here.</p>\n<p>I decided to make it appear as if the loading view <em>was</em> the launch screen and that loading view would fade in as the app launched. The launch screen is just a blank view with the background color set to match the color of my apps initial screen. Then my loading view is displayed with a fade in animation that presents a nice transition from the blank launch canvas to the actual UI. It’s fast enough in practice that it’s not noticeable what’s happening. The user just sees the UI fade in and the app is ready.</p>\n<p><strong>Sample App</strong></p>\n<p>I put together a <a href=\"https://gitlab.com/patrickmcconnell/swiftui-launch-screen\">sample app</a> that shows this in more detail and here is some explanation of the steps taken.</p>\n<p>In the sample app, which is similar to my current project, there is a view model that fetches some data and reports its state. The state of the view model can be one of <em>loading</em>, <em>ready</em> or <em>error</em> depending on the result of the data fetch.</p>\n<p>There is a main view that switches its display based on the state of the view model. So on initial launch, while the view model state is <em>loading</em>\" a LoadingView is shown, as shown below:</p>\n<p><img title=\"content_view.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/879ff6a6c4.png\" alt=\"Content view\" width=\"528\" height=\"600\" border=\"0\" /></p>\n<p>The loading view presented can be any SwiftUI view. The idea with this sample app is that the background color matches between the loading view and the launch screen setting. This requires creating a new color asset in Xcode for the color to be shared. This is necessary because in order to specify the Launch Screen Background Color in the Info.plist it must be a named asset. So in the Assets of the Xcode project select Editor -> Add New Asset -> Color Set (or select a Color Set from the + button in the lower left of the Asset panel. </p>\n<p>Name the color as desired and configure it to your needs. In the sample project the color is named “blueAssetColor” and it’s just the standard predefined “systemBlue” You can not use the predefined color names in the info.plist.</p>\n<p><img title=\"Screenshot 2023-05-03 at 18.24.21.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/5806276b8a.png\" alt=\"Screenshot 2023 05 03 at 18 24 21\" width=\"684\" height=\"427\" border=\"0\" /></p>\n<p>Next you need to tell Xcode to use this color as the background for your launch screen. Navigate to the info.plist by selecting the project in the Project Navigation, selecting the target for the app and the info pane in the editor. Find the item for Launch Screen and add an item within that group for Background Color entering the asset color you created earlier. In our sample project this value is “blueAssetColor”  There may be an item under Launch Screen when you first expand the item in the info editor labeled “UILaunchScreen” you can delete this entry.</p>\n<p><img title=\"Screenshot 2023-05-03 at 18.26.17.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/2d1565f30a.png\" alt=\"Screenshot 2023 05 03 at 18 26 17\" width=\"926\" height=\"369\" border=\"0\" /></p>\n<p>With these steps completed the your app should launch with a blank launch screen and the background color will be the one you have specified here.</p>\n<p>The loading view can be virtually any SwiftUI view as long as the background color matches the launch screen color. The trick is to have your UI elements fade in over time. The code below shows how to use an animation to fade in the UI over two seconds. The first animation in the code is just to rotate an image on the loading view to indicate the app is working. The fade in animation is setup on the onAppear block later in the code.</p>\n<p><img title=\"loading_view-4.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/ae459cffd5.png\" alt=\"Loading view 4\" width=\"680\" height=\"1279\" border=\"0\" /></p>\n<p>The end result is a loading screen that look like the following: </p>\n<p><img title=\"Screenshot 2023-05-03 at 18.52.53.png\" src=\"https://cdn.uploads.micro.blog/1998/2023/45e1d8e967.png\" alt=\"Screenshot 2023 05 03 at 18 52 53\" width=\"307\" height=\"609\" border=\"0\" /></p>\n<p>All the elements in yellow will fade in over the blue background. The fish image will also rotate as it is faded into view. The loading view is just standard SwiftUI and could be any view you like. Once the view model reports it’s <em>ready, </em>the app will transition to the main UI view and the user can get to work.</p>\n<p><a href=\"https://gitlab.com/patrickmcconnell/swiftui-launch-screen\">The full source for a sample project is available via GitLab</a> This approach may or may not apply to your projects but it does show a different way to think about Launch Screens. If you have any comments or suggestions I can be found on <a href=\"https://mastodon.social/@patrickmcconnell\">Mastodon</a> or via <a href=\"mailto:patrick@squirrelpointstudios.com\">email</a></p>\n",
				"date_published": "2023-05-04T12:09:37-04:00",
				"url": "https://pmcconnell.micro.blog/2023/05/03/creating-a-swiftui.html",
				"tags": ["Geekery","Swift"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/04/22/filling-in-the.html",
				"title": "Filling in the Gaps",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>One of the perks of self-employment, probably the biggest one, is being able to use your time as you see fit. So feeling like I needed a mental health day in the mountains I took a nice long hike on Thursday.</p>\n<p>The temperature started at around 45º but it was going to warm up with sunny skies. It did eventually reach 65º.  I was probably underdressed for the start in shorts and a shirt but I always say you need to dress for the weather you want. I’m not foolish so I do carry extra layers in case that doesn’t work out.</p>\n<p>One of the ways I decide to where to hike is looking at my past GPS tracks and look for missing segments. This is just one handy feature of having OCD. I have long had a gap in the Overlook Trail between Overlook Mountain and the Devils Kitchen. I’ve done this trail from both ends many times but not hiked the whole distance between the two trailheads with a GPS. Yes, I did walk the trail from Devils Kitchen to the Fire Tower on Overlook many years ago pre-GPS but that doesn’t count for GPS enabled OCD. I decided to rectify this glaring omission.</p>\n<p><img title=\"IMG_2041.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/afc5ffecbd.png\" alt=\"IMG 2041\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I started this walk from the Northeast end at the trailhead in the <a href=\"https://catskillcenter.org/platte-clove-preserve\">Platte Cove Preserve.</a> In peak season it’s difficult, if not impossible, to park at the preserve due to the waterfalls accessible via a few short hikes. On this weekday spring morning I was only the second car here.</p>\n<p><img title=\"IMG_2045.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/4b48adcee0.png\" alt=\"IMG 2045\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Having visited the falls here several times I made good time heading through the preserve to where it connects to the the Devils Path heading towards the Devils Kitchen Lean-to. It was one of those days where you seem to have boundless energy and I made good time.</p>\n<p><img title=\"IMG_2049.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/bfa93183f9.png\" alt=\"IMG 2049\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>At the junction to the Devils Path is the first of many old bluestone quarries to be seen along this route. In the 19th century much of this area was dedicated to extracting bluestone and supplying it to local cities for their sidewalks and other use. Today the quarries are mostly used by rock stacking and chair building aficionados. </p>\n<p><img title=\"IMG_2051.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/dc0d9969ec.png\" alt=\"IMG 2051\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It’s interesting to poke around these areas to see how widespread the quarry work was. I suspect many hikers walk past much of this without even noticing. Nature has a way of reclaiming these areas and unlike other quarries that tend to leave huge holes in the ground, these are more surface level and little remains to be seen but stack of rock and a few larger pieces of stone that look ready for market but never made it out of the woods.</p>\n<p><img title=\"IMG_2059.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/440edac755.png\" alt=\"IMG 2059\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>A short distance from where the preserve trails join the Devils Path is the Devils Kitchen lean-to. This is great camping spot being situated right on a creek. The lean-to has seen better days and the lean in this case is from the structure tilting to the right quite a bit.</p>\n<p><img title=\"IMG_2063.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/f1503302bf.png\" alt=\"IMG 2063\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Further along the trail is a larger quarry. It has some nice views out to the Hudson River. <img title=\"IMG_2065.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/10601e2526.png\" alt=\"IMG 2065\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>This quarry is on a spur trail off the Devils Path that parallels the trail for about a half mile. There was extensive work done here long ago and it’s interesting to see and imagine all the work happening in these now quiet woods. While you may feel a long way from civilization at this point, the Devils Path was originally a road so the quarry would have been well situated to get the stone to market,.</p>\n<p><img title=\"IMG_2070.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/fc00824027.png\" alt=\"IMG 2070\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>This section of trail is also a designated bike trail and for long stretches the grade is gentle and it’s not your typical Catskill trail that reminds you more of a stream bed than trail. A mile or two after the quarry spur trail is the trail to Echo Lake. The area around the lake is a bit too popular and any time I’ve visited it was a bit trampled over. I decided to skip it for today. </p>\n<p>In another mile or so the trail begins to climb but not too aggressively. The trail skirts the edges of Overlook mountain winding around to the area most often accessed via the southwestern trailhead on Meads Road across from the <a href=\"https://kagyuktd.org/#visit\">KTD Monestary.</a> The Monestary itself is worth visiting if you’re passing through that end of the woods. </p>\n<p><img title=\"IMG_2077.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/bdbc0c023a.png\" alt=\"IMG 2077\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>As you wind around and climb to the peak of Overlook Mountain you can begin to make out the tower above the trees (yes, it’s in that picture above.) This area is also notorious for rattlesnakes but I didn’t see any on this day in spite of the warm sun that they normally enjoy. Yes, the <a href=\"http://www.catskillmountaineer.com/animals-snakes.html\">Catskills (and parts of the Adirondacks) do have a rattlesnake population</a>.</p>\n<p><img title=\"IMG_2078.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/384e4c873b.png\" alt=\"IMG 2078\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I’ve been to this tower many times and while the view from the tower is great I always enjoy the stone ledge views that most certainly led to this mountain getting its name. The view above is of Ashokan Reservoir with the village of Woodstock nestled in the trees as well.</p>\n<p><img title=\"IMG_2088.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/ab96b6edea.png\" alt=\"IMG 2088\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>These rock ledges in the Catskills have long been popular and many prior visitors have carved their names into the rock. Here are samples dating back to 1892 and there are many earlier carvings as well. </p>\n<p><img title=\"IMG_2090.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/8ae1d574fd.png\" alt=\"IMG 2090\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The tower was looking sharp against the bright blue sky and people were picnicking at the base on this near perfect day. </p>\n<p><img title=\"IMG_2100.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/1c73bf7622.png\" alt=\"IMG 2100\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Heading back I detoured briefly into the ruins just below the peak. The <a href=\"https://www.atlasobscura.com/articles/overlook-mountain-house\">ruins were to be a hotel</a> but were never fully completed. They replaced earlier iterations of the hotel that burned. Always fun to wander and a great spot for photos.</p>\n<p><img title=\"IMG_2103.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/0d70e9f217.png\" alt=\"IMG 2103\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>On the return trip, just below the summit a spooked a deer who was probably drinking at the stream as it crossed the trail. The deer didn’t run off and probably wanted me to move along so it could get back to doing deer things. </p>\n<p>The walk back was scenic but uneventful. It is one of those rare Catskill hikes where the terrain underfoot is mellow enough that you can glance off the trail. Evidence of more quarries are seen if you look. At one point I spotted what looked like a bluestone stair tread, a piece of stone about one foot by four feet. I then found several more similar stones just off the trail. It’s not clear if this was a remnant of a structure or materials that were going from the quarries to a building somewhere far off. Being stone they were as good as new and if I had the means I would have gladly carted them home and put them to use.</p>\n<p><img title=\"Screenshot 2023-04-22 at 12.41.11.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/1a12485059.png\" alt=\"Screenshot 2023 04 22 at 12 41 11\" width=\"599\" height=\"412\" border=\"0\" /></p>\n<p>This round trip on a perfect spring day covered 10.6 miles with a gentle ascent of over 1,400 feet. Now that section of trail is filled in. Time to find more gaps and get back out there.</p>\n",
				"date_published": "2023-04-22T12:58:43-04:00",
				"url": "https://pmcconnell.micro.blog/2023/04/22/filling-in-the.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/04/09/a-few-miles.html",
				"title": "A Few Miles in the Sun",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>I’ve said in previous posts that many of my hikes are return visits to old familiar places. Sometimes it’s not about discovery it’s just about getting out. With that in mind, I got in a great hike today around the woods at <a href=\"https://www.dec.ny.gov/outdoor/24487.html\">North/South Lake</a></p>\n<p>I started the hike from the beginning of the <a href=\"https://townofhuntergov.com/kaaterskill-rail-trail/\">Kaaterskill Rail trail</a> knowing I just wanted to get in some miles in the woods and this would let me pad my walk without too much thinking. The snow has all but cleared out at the 2,000’ level though some of the north facing peaks had snow hanging on at what appeared to be around 3,000’.  This area around the lake and rail trail lies at about 2,000’ feet so the only remaining snow was in deep shaded pockets. It was nice to walk on mostly dry ground.</p>\n<p><a href=\"https://pmcconnell.micro.blog/2022/12/11/my-own-personal.html\">When we last saw the old train depot</a> it was covered in snow. Today it’s free of winters grasp and looking well.</p>\n<p><img title=\"IMG_2017.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/ece58e635f.png\" alt=\"IMG 2017\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>With much of the snow gone there was quite a bit of action in all the seasonal creeks and other waterways along the trail. The pictures won’t do it justice but if you spend any time in the woods you know how relaxing it is to spend a few minutes at these spots.</p>\n<p><img title=\"IMG_2020.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/ce6e3d4833.png\" alt=\"IMG 2020\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p><img title=\"IMG_2034.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/75b72196a6.png\" alt=\"IMG 2034\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The lake was reflecting the bright sunlight and it seems it’s time to apply the sunscreen again for the next 8 months.</p>\n<p><img title=\"IMG_2036.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/757f43568b.png\" alt=\"IMG 2036\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Not much new ground covered today but I did come across one interesting spot I’ve seen before that I don’t recall getting photos of. As this area is now largely a state campground and day use area there are many campsites, picnic spots and other facilities. One spot has several fire pits that appear to have been left to the elements in the woods. Not clear why these would not be cleared and used as any time I’ve visited in season the place is full.</p>\n<p><img title=\"IMG_2028.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/bc90bdd834.png\" alt=\"IMG 2028\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>In this second shot there are at least 3 abandoned fire pits if you look hard enough.</p>\n<p><img title=\"IMG_2030.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/9edd708498.png\" alt=\"IMG 2030\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>7.5 miles hiked and a whopping 336 feet of elevation gained. Much fresh air and sun was had.</p>\n<p><img title=\"Screenshot 2023-04-09 at 18.11.53.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/159b7ae3f9.png\" alt=\"Screenshot 2023 04 09 at 18 11 53\" width=\"598\" height=\"293\" border=\"0\" /></p>\n",
				"date_published": "2023-04-09T18:17:04-04:00",
				"url": "https://pmcconnell.micro.blog/2023/04/09/a-few-miles.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/03/11/winters-last-gasp.html",
				"title": "Winters Last Gasp (hopefully)",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>After 3 weeks of lingering cold symptoms (not covid but annoying regardless) I finally got out into the woods. It snowed a few inches last night at the house but I suspected the hills would have more and I was correct. I probably bit off more than I needed to so soon after not leaving the couch for a few weeks but I survived.</p>\n<p>The Mount Riga State Park is a Connecticut park right at the northwest corner where Massachusetts, New York and Connecticut come together. This hike would have me park my car (or more correctly “cah\") in Mass., snowshoe through Conn. and summit in NY</p>\n<p>Since I was sure I was not in shape for a stressful trip I avoided the routes with a few steep climbs over peaks that I’ve done before and took the road trail. The road through the park is closed in the winter so it was a nice wide strip of fresh, heavy snow to trek though.</p>\n<p><img title=\"IMG_1998.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/4263f478c3.png\" alt=\"IMG 1998\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The 2” of snow we got at home was 6-8” along the closed road and as I traveled up to elevation it was 10-12” This was a journey with no real destination. The goal was to just get out in the woods and I accomplished that.</p>\n<p>`<img title=\"IMG_2002.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/fc8149ef6c.png\" alt=\"IMG 2002\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p><img title=\"IMG_2003.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/a67c49c1f9.png\" alt=\"IMG 2003\" width=\"600\" height=\"450\" border=\"0\" /><img title=\"IMG_2007.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/d993ce3fad.png\" alt=\"IMG 2007\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It’s not clear from the last photo but I turned around before the potential view because the clouds were in the process of settling on the peak so there would be no views today.</p>\n<p><img title=\"Screenshot 2023-03-11 at 16.58.24.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/0c792e554c.png\" alt=\"Screenshot 2023 03 11 at 16 58 24\" width=\"600\" height=\"408\" border=\"0\" /></p>\n<p>About 6 miles of trail breaking through some moderate depth snow. This snow won’t last long as there was little in the surrounding areas at lower elevations and temperatures are rising, slowly week to week. The snow clinging to the trees was falling the entire trip and I am hopeful mud season starts soon enough, as bad as that sounds. This was a very pretty trip in the woods but I’m ready for spring.</p>\n",
				"date_published": "2023-03-11T18:07:36-04:00",
				"url": "https://pmcconnell.micro.blog/2023/03/11/winters-last-gasp.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/02/12/winter-hanging-on.html",
				"title": "Winter Hanging on in the Woods",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Had a break from work on Friday and the temps were hovering around 50º for a bit so I needed to get out in the woods. I didn’t have time for an all day trip so I headed back to the Pittsfield State Forest and its web of tangled ATV/Hiking trails. </p>\n<p>The trails in this forest are accessed from several different trailheads so I figured I’d try a new approach. The first trailhead had private signs marking the road barrier. I had my doubts if that was a legit warning as the road is still on the map as a public right of way but since there is another trailhead about a mile away I decided to try that alternative.</p>\n<p>The official road ends at about 1,400’ of elevation and there was only a bit of old snow on the road as it entered the woods. The wind was picking up and the 50º temperature was not going to last.</p>\n<p><img title=\"IMG_1988.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/69f63d72d8.png\" alt=\"IMG 1988\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Due to this still being a “road” on smaps both sides had private property for about 3/4 mile before getting into the actual state land. There was quite a bit of evidence of logging including run down trucks, equipment and rough barn buildings. </p>\n<p><img title=\"IMG_1989.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/eadf08fa1a.png\" alt=\"IMG 1989\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>After entering the state forest section the snow was deeper and there was some ice on the trail. This trail is also for ATV/Snowmobiles so it is basically a rutted track in spots sometimes 5 feet or more wide and a few feet deep. This does not give the meltwater anywhere to go so it freezes into a bobsled run in spots. Nothing that can’t be walked around and the snow/ice was melting quickly.</p>\n<p><img title=\"IMG_1990.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/518c4ca3cd.png\" alt=\"IMG 1990\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There are so many intersecting trails for all sorts of purposes that you need to keep an eye on the map or GPS. You never get so far off into the wilderness that you will be lost for long but you could easily come out of the woods miles from where you parked.</p>\n<p>I spotted this tiny birdhouse like item hanging from a tree at the junction to the Tower Mountain trail. The whole thing might be 3 inches tall. No clue what it is. You always see interesting things in the woods if you stop and look.</p>\n<p><img title=\"IMG_1993.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/c4bc96b35b.png\" alt=\"IMG 1993\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Tower Mountain is named for the former firetower that once stood on its peak. The tower is long gone but a sign remains to mark the spot.</p>\n<p><img title=\"IMG_1994.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/8645ecbccc.png\" alt=\"IMG 1994\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Upon reaching the summit of Tower Mountain, the wind was really picking up and the temperature had dropped from the elevation gain as well as the front apparently moving in. I elected to not go much further so I picked a trail that would circle back to the car via the <a href=\"https://taconichikingclub.org/taconic-crest-trail\">Taconic Crest Trail</a>. This trail intersects the various ATV tracks all through the woods up here but is in better shape than the machine trafficked trails due to it being lightly used and only by hikers. The Taconic Crest Trail straddles the border between NY/VT &amp; MA for over 30 miles along the ridge of the Taconic range. I’ve walked most of this trail in bits and pieces. It’s a very nice quiet trail that visits some interesting spots. One day it would be nice to make a weekend trip of the entire trail.</p>\n<p><img title=\"IMG_1995.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/f98e7805f8.png\" alt=\"IMG 1995\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Covered just under 3.5 miles with 630 feet of climbing. While micro-spikes would have been helpful in spots there was nothing that could not be avoided. The biggest issue besides the wind gusts was the rate of melting snow causing it be very wet and some cold feet.</p>\n<p><img title=\"Screenshot 2023-02-12 at 6.38.17 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/34046ccf05.png\" alt=\"Screenshot 2023 02 12 at 6 38 17 PM\" width=\"600\" height=\"514\" border=\"0\" /></p>\n<p>After several hikes in this area, I’ve only scratched the surface what’s here. I’ll be back again soon.</p>\n",
				"date_published": "2023-02-12T19:49:48-04:00",
				"url": "https://pmcconnell.micro.blog/2023/02/12/winter-hanging-on.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/01/31/a-influx-of.html",
				"title": "A Influx of Vitamin D",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Saturday I wanted to do something a bit more challenging that my recent local hikes but not too technical. On days like these I tend to revisit a favorite hike so I decided to hike Hunter Mountain from Sprucetown Road. I’ve done this hike dozens of time so I told myself I’ll just walk up until I feel like turning around. I don’t need yet another picture of the fire tower on top of the mountain.</p>\n<p><img title=\"IMG_1978.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/e5af5f67c6.png\" alt=\"IMG 1978\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There was some snow on the trail but it had been heavily trafficked recently so snowshoes were not needed. I slipped on my spikes to ensure some good traction and headed out. I did strap the snowshoes to my pack in case I needed them higher up.</p>\n<p><img title=\"IMG_1980.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/a40ee526cf.png\" alt=\"IMG 1980\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It wasn’t too cold but most importantly the sun finally made an appearance.</p>\n<p><img title=\"IMG_1979.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/63eba7432e.png\" alt=\"IMG 1979\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Can’t recall the last hike I was able to see my shadow.</p>\n<p>I walked the old road/horse trail towards the tower at a steady pace, relaxed that I had no real goal other than to just be out in the woods for the afternoon.  </p>\n<p><img title=\"IMG_1981.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/6458bfc333.png\" alt=\"IMG 1981\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>After a few miles of walking I reached the spring just below the John Robb lean-to and as usual it was still pumping out water into the old barrel. This must be one of the most reliable springs in the Catskills. I ventured past the former site of the lean-to and the trail to the newer one. The new one is in a far better spot a few yards of the trail but there are still some views looking back towards Rusk Mountain from the old lean-to site.</p>\n<p><img title=\"IMG_1984.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/5617a6cc38.png\" alt=\"IMG 1984\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I’m now at the age where I’be been hiking these mountains so long I can remember back when there were views in many spots that are now blocked from tree growth.</p>\n<p>I reached the turn off to the Colonels Chair, a trail I have never bothered to hike and after today I can still say I’ve never hiked that trail. Normally when I head out to Hunter I want to get to the top or complete the full loop and I don’t want to invest the 2 plus miles out and back to visit the ski slopes that launch from Colonels Chair. </p>\n<p>I did start out briefly on the spur to the slopes but after it descended a few hundred feet I decided I really didn’t want to climb the amount that would be required on the return trip. I can now say I’ve hiked about a quarter mile of that trail and one day I’ll finish it in my quest to fill in the map.</p>\n<p>After the quick aborted trip down the spur I decided it would be ok to just head down to the car, so I did.</p>\n<p><img title=\"IMG_1982.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/3c8ab234b5.png\" alt=\"IMG 1982\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It’s always surprising how steadily this trail climbs often taking more out of you than you recall from the last visit. In that case the way down is always far quicker and I was back to the car in about an hour covering over 3 miles. Not as quick as a few of the backcountry skiers I encountered but respectable for foot travel.</p>\n<p><img title=\"Screenshot 2023-01-31 at 4.10.44 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/49721bf08b.png\" alt=\"Screenshot 2023 01 31 at 4 10 44 PM\" width=\"563\" height=\"359\" border=\"0\" /></p>\n<p>A around 6 miles covered with 1,500+ feet of climbing. But most importantly I saw the sun.</p>\n",
				"date_published": "2023-01-31T17:16:38-04:00",
				"url": "https://pmcconnell.micro.blog/2023/01/31/a-influx-of.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/01/23/a-twofer.html",
				"title": "A Twofer",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>On Saturday I continued the quest to explore any and all local wilderness areas. I discovered there was a fire tower in a forest near Rhinebeck and being a big fan of fire towers I put this on the agenda. Nearby were a few other parks/preserves so I kept my options open to visit another spot, time permitting.</p>\n<p>About 30 minutes from me is <a href=\"http://ferncliffforest.org/\">Ferncliff Forest</a> and my maps showed a fire tower and several shelters for camping there. This looked like an interesting place to explore on yet another dreary gray January day.</p>\n<p><img title=\"IMG_1939.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/9a11a44da8.png\" alt=\"IMG 1939\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>A short walk from the parking area leads to a small lake/pond with 3 shelters. According to the website these shelters are all free to use but a reservation is needed. If you’re looking for a quick walk to an overnight camp spot these might be helpful. The forest is not far off the <a href=\"https://empiretrail.ny.gov/\">Empire State Trail</a> so these might also be useful for those on a bike tour. I’ve often thought of riding down to NYC or Long Island to visit friends and family so maybe these would come in handy one day.</p>\n<p><img title=\"IMG_1940.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/2881af199a.png\" alt=\"IMG 1940\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Next to another shelter, the beavers have been active and this was not the only spot showing signs of their work.</p>\n<p><img title=\"IMG_1946.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/0c1052b537.png\" alt=\"IMG 1946\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Another pond appears to be forming further along the trail due to the beaver dam blocking a stream.</p>\n<p>This forest allows mountain biking and it looks like bikers have taken that to heart. There are a lot of trails and they almost seem redundant in spots if you’re walking. There are trails right next to trails and some of the trails are clearly routed for single track fun, winding back and forth through the woods in ways you might not create a trail for walking.</p>\n<p>Not a problem as the trails are all in good shape but it does create the need to carry a map or have your GPS handy as there are many trails and it’s easy to get confused. My GPS didn’t even show all the trails here and it appears the map provided on the web site does not either. You’re not likely to get very lost as the forest is surrounded by roads and not all that large that you would find yourself trapped in a wilderness survival situation.</p>\n<p><img title=\"IMG_1941.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/9075a206e9.png\" alt=\"IMG 1941\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>As I mentioned, there are several different shelters and they are even different styles. There are a few traditional NYS style lean-tos.</p>\n<p><img title=\"IMG_1943.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/7d15085b2a.png\" alt=\"IMG 1943\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There are also some other interesting shelter designs. This one looks like it would be great for cold weather camping but I’m not sure how much wood you would find nearby.</p>\n<p><img title=\"IMG_1949.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/730046f9df.png\" alt=\"IMG 1949\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>After wandering the woods for a while I decided to seek out the tower I’d read about. It is situated in the middle of the forest on a high point as would befit a fire tower but it’s also quite a tall tower.</p>\n<p><img title=\"IMG_1952.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/5861fe9900.png\" alt=\"IMG 1952\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>That height gives you some great 360º views of the Catskills, Taconics and local farms. </p>\n<p><img title=\"IMG_1953.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/c3abe0182c.png\" alt=\"IMG 1953\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p><img title=\"IMG_1947.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/a5c83d2b4a.png\" alt=\"IMG 1947\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>As this is one of those local adventures you’re never far from civilization and on some of the trails you are actually right next to the road, in this case route 103/River Road. I only saw one car pass as I walked this stretch of trail for about a half mile so the road is lightly trafficked.</p>\n<p>It’s easy to create a few different routes through the forest and I ended up doing about 3.7 miles with a total ascent of 265 feet. If you’re looking for a low stress way to visit a fire tower and get some great views this is it.</p>\n<p><img title=\"Screenshot 2023-01-23 at 4.58.36 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/ea0acff472.png\" alt=\"Screenshot 2023 01 23 at 4 58 36 PM\" width=\"600\" height=\"580\" border=\"0\" /></p>\n<p>After I got back to my car I removed my muddy boots and started to head home. I figured I would take a scenic route along the river. I returned to River Road which seemed to promise something interesting. I had traveled less than a mile when I came upon a sign for <a href=\"https://www.scenichudson.org/explore-the-valley/scenic-hudson-parks/poets-walk-park/\">Poet’s Walk</a>. I had seen this when pouring over my maps looking for targets to visit so I figured I would pull in for a look.</p>\n<p>It’s only about about a mile, one way, down to the river from the parking area so I put my muddy shoes back on and headed out. I was quickly greeted by a woman from Scenic Hudson who runs the park. They are looking for someone to be a gatekeeper, closing the gate after hours. It did sound like my kind of community service but it’s too far a drive for me to do that every day. It is a paying gig so if you happen to be local look them up.</p>\n<p><img title=\"IMG_1966.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/f5dcf52c4d.png\" alt=\"IMG 1966\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The trails here wander from open meadows with distant Catksill views to wooded paths crossing over a few streams.</p>\n<p><img title=\"IMG_1962.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/e5347697e1.png\" alt=\"IMG 1962\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There are some nice examples of rustic architecture and furniture.</p>\n<p><img title=\"IMG_1968.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/a9e94dbe21.png\" alt=\"IMG 1968\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I imagine this place gets very crowded in the warmer months where people can spend time just lounging about in the fields.</p>\n<p><img title=\"IMG_1969.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/9d4aa47021.png\" alt=\"IMG 1969\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There are a number of stream crossings on the woods trails. The recent wetness created some slippery footing in that classic Hudson River Valley mud/clay soil. Micro-spikes would have helped in spots. It was very slick.</p>\n<p>The trail basically creates a loop either way you go and eventually you end at the river overlooking the train tracks to the mighty Hudson and the Catskills beyond.</p>\n<p><img title=\"IMG_1971.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/4ac4567207.png\" alt=\"IMG 1971\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>At the location called “Summer House” there is a gazebo and some other seating. The other destination near the river on the trail is called “The Lookout” both are clearly marked and very close to each other. The Lookout sits on a hill and again there are a a few benches to sit on.</p>\n<p>This quick walk added about 2.4 miles with 170 of “climbing” </p>\n<p><img title=\"Screenshot 2023-01-23 at 5.21.37 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/e13dee9e1b.png\" alt=\"Screenshot 2023 01 23 at 5 21 37 PM\" width=\"599\" height=\"404\" border=\"0\" /></p>\n<p>Not a bad way to spend another gray Saturday. Always impressed with these preserves or little pockets of wilderness. They’re not always the same as climbing one of the high peaks but sometimes you get your wilderness in different ways. I’m glad these sorts of places are here. Thanks for people like <a href=\"https://www.scenichudson.org/\">Scenic Hudson</a> for creating these resources.</p>\n",
				"date_published": "2023-01-23T18:35:55-04:00",
				"url": "https://pmcconnell.micro.blog/2023/01/23/a-twofer.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2023/01/16/spring-runnoff-in.html",
				"title": "Spring Runnoff in January",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>In an effort to visit every “local” patch of nature I ventured to the <a href=\"https://newbaltimoreconservancy.org/nbc-trails/\">Hannacroix Creek Preserve</a> in New Baltimore on Saturday. I’m not very familiar with much on the other side of the river so this was a mission of exploration. The map showed a waterfall and I expected to see it flowing due to the recent rains. </p>\n<p><img title=\"IMG_1916.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/c705a80297.png\" alt=\"IMG 1916\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The trail can be accessed from two locations, one on NYS route 144 and another just off the Main Street up Madison Avenue and situated next to a church retreat center. I chose to park at the later location.</p>\n<p><img title=\"IMG_1917.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/4ee40e49ce.png\" alt=\"IMG 1917\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Upon entering the woods it is immediately apparent this was a well traveled road at some point. Stone walls and a few foundations are quickly spotted.</p>\n<p><img title=\"IMG_1920.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/1f235c4f25.png\" alt=\"IMG 1920\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>One section of walkway is quickly reached in a low area. No danger of water today but a light dusting of snow on the smooth boards can be slippery.</p>\n<p><img title=\"IMG_1918.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/32a380f9ea.png\" alt=\"IMG 1918\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>At the end of the more pronounced woods road a junction is reached at the Hannacroix Creek. The creek itself is not very exciting, your standard creek through the woods, but just off to your left is a small trail that leads to the waterfall noted on the map. The falls are not terribly high but still provide some scenic bang for their buck and were running well from the recent rains.</p>\n<p><img title=\"IMG_1923.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/b009db9f61.png\" alt=\"IMG 1923\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>No swimming signs are present every few yards but I expect they are often disregarded in the warmer months. This looks like one of those spots that is best visited in the off season to avoid the masses.</p>\n<p>Continuing back on the aptly named Paper Mill Trail you soon come to the namesake ruins of the Croswell-Parsons Paper Mill</p>\n<p> <img title=\"IMG_1926.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/62b4ac54b2.png\" alt=\"IMG 1926\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The rest of the trail wanders up and down a bit until you reach the other parking area along route 144. From there you can return via a slightly different route or cross the road to another short trail leading to the Hudson.</p>\n<p>Along the way to the river, more ruins are spotted including this chimney up on  a slight rise</p>\n<p><img title=\"IMG_1927.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/3e9b6f31b5.png\" alt=\"IMG 1927\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Another sight is this truss bridge constructed from recycled plastic. I guess this is better than letting the plastic not rot in landfills. It can resist rotting here on the trail and provide a way to cross the tidal stream.</p>\n<p><img title=\"IMG_1929.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/d042e16b5a.png\" alt=\"IMG 1929\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>While we are not experiencing anything like a normal winter weather wise, it was still too cold to linger long at the rivers edge and there really isn’t much to see once you reach the river.</p>\n<p><img title=\"IMG_1930.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/28cbd00d0f.png\" alt=\"IMG 1930\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Just a traditional New York winters day with gray upon gray. Snow might improve this scene if I’m being honest.</p>\n<p><img title=\"IMG_1931.png\" src=\"https://pmcconnell.micro.blog/uploads/2023/d5f9b82b4b.png\" alt=\"IMG 1931\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I headed back to the car by way of a slightly different set of trails. My apps were all over the board with mileage for this one. The phone shows one thing and the watch another. This was about 3.5 miles give or take and only few hundred feet of climbing.  The screenshot below is from a new to me promising app called Footpath. I am a long time GaiaGPS user but they seem to be slow fixing things or adding new features since being acquired by Outside so I’m keeping my options open. If all else fails I still know how to use a map and compass.</p>\n<p><img title=\"IMG_0184.JPG\" src=\"https://pmcconnell.micro.blog/uploads/2023/4d748d2c9c.jpg\" alt=\"IMG 0184\" width=\"600\" height=\"600\" border=\"0\" /></p>\n<p>Heading out to a new local slice of wilderness is often a pleasant surprise and rarely disappoints. This is another such case. The scenery was pleasant and the walk was enough to get the blood pumping without straying too far from home.</p>\n",
				"date_published": "2023-01-16T11:46:59-04:00",
				"url": "https://pmcconnell.micro.blog/2023/01/16/spring-runnoff-in.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/30/warmer-is-not.html",
				"title": "Warmer is Not Always Better",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>I can’t say I’ve been working on the <a href=\"http://catskill-3500-club.org/peaks.php\">Catskill 3500</a> list as I’ve been hiking the list peaks for over 30 years and I’m still not done. Let’s call it nibbling on the list. I sometimes get the idea to do something foolish like visit one of the peaks I’ve yet to summit. So today it being in the 50s at home I figured it was a good day to check off my 3rd of the winter peaks, Panther Mountain. Mistakes were made.</p>\n<p>I left home a bit late but my gps app said it was only 3 miles to the Panther Summit with about 1,600 of climbing. The numbers were off and really didn’t reflect the level of difficulty. Last week this area received over 24” of snow and most of that snow remains at elevation. The lower elevations are a slippery icy mess from all the traffic over the past holiday week. I saw more than one group of smart hikers turn back at the first of the steeper patches as they didn’t have proper footgear. </p>\n<p>The first mile plus was either ice of well packed snow that only required microspikes to navigate. Still there were areas where footing was not great and my feet would often slip on the snow now warming enough to become soft slush. This would be a theme for the full trip.</p>\n<p><img title=\"IMG_1895.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/79c96cbab0.png\" alt=\"IMG 1895\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The first vantage point is the highly trafficked Giant Ledge but even before the ledges there are some good off season views at the Burroughs Range through the trees. The drop from the backside of slide down to Cornell is very obvious from this vantage point. I remember one of our death march hikes when we were younger and more foolish when we dropped off Slide into a deep snow drift on what would then need to be a one way trip down to Woodland Valley.</p>\n<p><img title=\"IMG_1899.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/3ac4f9ec27.png\" alt=\"IMG 1899\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>There is a reason Giant Ledge is so frequently visited and its views like these. Very few locations let you see so many Catskill peaks in one panorama. The sun did break out later only improving the view.</p>\n<p>The path up to Giant ledge, while slippery, was fairly well packed and had not softened as much as the col to Panther or the Panther summit. I only started to descend a few yards off Giant Ledge before it became clear that snowshoes were more appropriate to avoid postholing every third step. Snowshoes are both a blessing and a curse as they allow you to float over some obstacles but their general unwieldy size often make them tricky to maneuver in tight spaces or the typical Catskill steep rock climbs.</p>\n<p><img title=\"IMG_1896.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/0ab53671df.png\" alt=\"IMG 1896\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>At this point I was regretting not bringing quite enough water or snacks a decision I would regret later. My late start was also becoming an issue made worse by the slow slippery travel. I met another hiker who called this a “technical day” and that sounds right to me.</p>\n<p><img title=\"IMG_1907.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c2790416fc.png\" alt=\"IMG 1907\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I didn’t recall much of a view from Panther on my past visits but I was able to get some shots through the trees. I wanted to reach the summit by 2:30PM in order to have 2 hours to get back to the car and I was already about 15 minutes behind schedule.</p>\n<p>News of the warming trend clearly not reached this elevation and I was wet, almost out of water and hungry. I drank most of my water, ate a Larabar and added another layer. What I could not do was linger as the sun would set in less than 2 hours and I figured that’s how long the trip down would take</p>\n<p>My feet were soaked through my “waterproof” boots and standing still for more than a minute would make this painfully obvious. Even catching my breath was not ideal at this point as I was wet and needed to get moving and warm again. So I began the walk down.</p>\n<p>At one point I tripped over my snowshoes one too many times and decided to take them off. I was too tired and they were not helping as much as I would like. I put the spikes back on an made better time. Yes I added a few post holes but I assure this trail was already cratered before I got there. Every step was twice as difficult as it would have been on a clear trail. It was a crapshoot if your foot would finish where you placed it. The ice, slush and soft snow made this portion of the hike an adventure.</p>\n<p>I made better time without the snowshoes but I’ve rarely felt this worn out with half of the hike still left to complete. Hopefully the snack, water and heading back down would warm me up and give the enough fuel to finish before dark. In the end, it did. It was not the most enjoyable trip down but once I warmed up it went ok.</p>\n<p>As I got down off the other side of Giant Ledge, on the way back to the car, I saw another hiker heading up. I assumed I would be the last person on the mountain today as the sun was only minutes from setting. I asked the hiker how far he was going and he said Panther. He clearly looked like he knew what he was doing and I enquired if he had lights and he pointed as some fancy led array of lights on his chest and mentioned he had just done the entire Burroughs range this morning. I remember when I was younger and stronger too. </p>\n<p>At the blue/yellow trail intersection marking the last 3/4 mile remaining to the parking area, I changed my wet hat and gloves for a fresh dry set and this too gave me a boost. I also placed a flashlight in my pocket. The sun had set but twilight was doing enough. Good thing too as the flashlight died as soon as I tried to use it to light up a tricky patch. I have a few other lights but at this point I was very close to being done so I really didn’t want to take off my pack one more time to change lights. The only point I really needed illumination was to check out in the log book at the trailhead.</p>\n<p>Gaia GPS said this was 3 miles up to Panther. My Apple Watch logged about 8 miles traveled and at least 500 feet more elevation that Gaia reports. The final (lesser) stats for the day show 6.5 miles traveled and 1,816 feet of climbing. It felt like at least 50% more due to the conditions and probably a few too many holiday cookies over the past week.</p>\n<p><img title=\"Screenshot 2022-12-30 at 9.08.54 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/dd475e7014.png\" alt=\"Screenshot 2022 12 30 at 9 08 54 PM\" width=\"600\" height=\"566\" border=\"0\" /> </p>\n<p><img title=\"Screenshot 2022-12-30 at 9.08.37 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/378535630e.png\" alt=\"Screenshot 2022 12 30 at 9 08 37 PM\" width=\"570\" height=\"414\" border=\"0\" /></p>\n<p> </p>\n",
				"date_published": "2022-12-30T22:17:57-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/30/warmer-is-not.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/18/so-much-white.html",
				"title": "So Much White",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Headed out today to see how much snow fell in the Catskills from the last storm. Turns out it varied widely. At lower elevations there were spots in the southern Catskills around Palenville that had no snow at all. Areas in the northern Catskills around Windham appeared to have almost two feet of fresh snow.</p>\n<p>Everywhere that snow had fallen it was heavy and wet so it was still clinging to the trees as the sun had not made an appearance until today. It makes for a white winter wonderland.</p>\n<p><img title=\"IMG_1879.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/49fc22a36b.png\" alt=\"IMG 1879\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>I wanted to get out on my snowshoes and since I haven’t done any snowshoeing since last season, I didn’t want to do too much. I decided to see how clear the road into West Kill was and it turns out it was plowed all the way to the last trailhead.</p>\n<p><img title=\"IMG_1863.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c75cc6301f.png\" alt=\"IMG 1863\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>As this was just a shakedown trip to give the hips a chance to get used to the wider stance of snowshoes, I only did a short trip to Diamond Notch Falls figuring that would let me grab some nice photos. This area had about 10-12 inches of snow off trail. The snowshoes were probably overkill as the trail was broken all the way to the falls. </p>\n<p><img title=\"IMG_1878.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/f3424a2ef6.png\" alt=\"IMG 1878\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Turns out the actual falls are probably more photogenic when they are not covered in snow but the whole area was spectacular today.</p>\n<p><img title=\"IMG_1868.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/ce6a2404f5.png\" alt=\"IMG 1868\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p> </p>\n<p><img title=\"IMG_1875.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/1c89ec3ee1.png\" alt=\"IMG 1875\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Only two miles for the day and a 230’ ascent winding through the saplings bent over from the weight of the snow and ice. By the time I headed back to the car the sun was breaking through so I suspect the trees will be freed of their burden shortly and spring back upright.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c817e1fb95.png\" alt=\"UntitledImage\" width=\"485\" height=\"600\" border=\"0\" /></p>\n",
				"date_published": "2022-12-18T17:06:40-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/18/so-much-white.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/17/snow-day-game.html",
				"title": "Snow Day Game Dev",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>After clearing the  heavy wet snow from the driveway this morning, I spent most of the day coding on a MUD. </p>\n<p>This scratches the itch to make something game-like without getting bogged down with graphics. I can get right into the parts I enjoy creating.</p>\n<p>Its fun to take yet another stab at socket programming and message parsing. It’s also rewarding to get a world up and running relatively quickly where you control all the rules.</p>\n<p>I had some old code but, as is always the case, it was bad. I don’t know what that other me was thinking. I started from scratch this time. It’s written in Go since I’ve been working with that for the day job lately and Go works well with this sort of project. Sometimes you want to learn a new language or framework and sometimes you just want to make something with comfortable tools. Today was the later.</p>\n<p>In the past I’ve created these sorts of things in the traditional way with text files for data storage but for this project I added Postgres for my storage layer. It’s overkill but the whole project is overkill. No one is going to play this but it’s fun to hack on something that’s completely of my design.</p>\n<p>Here is the world in all it’s glory after a few hours:</p>\n<blockquote>\n<p style=\"text-align: left;\">look</p>\n<p style=\"text-align: left;\">Room 1 - (19c4361b-f382-43e7-b708-03b5d73b3454)</p>\n<p style=\"text-align: left;\">The first room</p>\n<p style=\"text-align: left;\">Exits: East</p>\n<p style=\"text-align: left;\">Say Hello mud!</p>\n<p style=\"text-align: left;\">You said 'Hello mud!'</p>\n</blockquote>\n<p style=\"text-align: left;\">I even took the time to create admin tools to work with the database. So I can just run migrations from my admin tool or seed the database quickly.</p>\n<p style=\"text-align: left;\">I worked on the code in <a href=\"https://nova.app\">Nova</a>, the Mac editor from Panic and it’s very good. It is very Mac like and extensible. While it seems most people use it for web dev there are some decent plug-ins for Go. I can do most everything I do in VS Code in Nova except debugging. I did have to swap over to VS Code a few times since its so easy to debug there. </p>\n<p style=\"text-align: left;\">The best part of this project so far is getting into the flow. I find it less likely that I can get into that mental state when I’m working on a project consulting for others. It takes a lot to get up to speed and if I didn’t create the architecture or requirements I find it slows me down. When I do my own projects I am far, far more likely to just bang away and find 4 hours have passed. That’s the part of this work that is most enjoyable. When the code seemingly writes itself. If you were to stop and look over your own shoulder you would probably have no clue what is going on but the person in that trance like flow does know what’s going on and it works. </p>\n<p style=\"text-align: left;\">The only downside to that state of mind is being interrupted. Even a simple question that breaks the spell can be far more irritating than it really should be.</p>\n<p style=\"text-align: left;\">This project amuses me and it’s in good enough shape to shelve it and come back when that inevitably happens. Of course by that time older me with think today’s me quite a silly person for some choices I made here but for now I’m content.</p>\n<p> </p>\n",
				"date_published": "2022-12-17T19:44:34-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/17/snow-day-game.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/11/my-own-personal.html",
				"title": "My Own Personal State Park",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>When I know I need to get outside but I don’t know where to go, I often revisit the same places. I’ve hiked Hunter Mountain probably two dozen times. Another place I often revisit is <a href=\"https://www.dec.ny.gov/outdoor/24487.html\">North-South Lake Campground</a>. Today’s light snow made another visit to North Lake an easy pick.</p>\n<p><img title=\"IMG_1835.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/a5ad466110.png\" alt=\"IMG 1835\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The campground is located in Americas very first vacation destination and the region gave birth to one of our country’s first art movements, the Hudson River School.  Artists from the region began painting the wilderness which made this region an early destination for vacationers prior to the civil war and up until the middle of the 20th century. Naturally, people still visit this region but at it’s peak it was the destination in the young nation.</p>\n<p><img title=\"IMG_1831.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c9541d3ed8.png\" alt=\"IMG 1831\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Several grand hotels were located on the land that is now occupied by the campground and adjacent state forests. In order to cater to their visitors desires to see the Catskill wilderness a large network of trails and woods roads were created. Many of these trails remain today.</p>\n<p>These hotels and the region were so popular at their height that railroad lines were constructed to get to the hotels. The depot of the Delaware &amp; Ulster Railroad has been restored and is at the start of the <a href=\"https://townofhuntergov.com/kaaterskill-rail-trail/\">Kaaterskill Rail Trail</a></p>\n<p><img title=\"IMG_1819.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/22da27e328.png\" alt=\"IMG 1819\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Today’s walk began at the historic train depot and follows the rail trail for over a mile before coming to Kaaterskill Falls. This is the only rail trail I’ve visited that still has many wooden ties left in place. You need to watch your step, particularly when it’s wet or icy.</p>\n<p><img title=\"IMG_1821.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/cb23504478.png\" alt=\"IMG 1821\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>After about 1.5 miles the trail comes to the site of the former Laurel House Hotel and an observation platform for the Kaaterskill Falls. Over the past few years these falls have become very popular and often feel like they may be in danger of being loved to death. It’s easy to see why as you can park and walk a 1/2 mile to an amazing view.</p>\n<p><img title=\"IMG_1858.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c5df69c73b.png\" alt=\"IMG 1858\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>After leaving the falls, there are a number of trails and old roads that wander through the woods. With no particular destination in mind I followed the old rail line farther until I reached the lakes themselves.</p>\n<p><img title=\"IMG_1837.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/ba634cd093.png\" alt=\"IMG 1837\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>If current conditions persist, in a few weeks the lakes will be busy with snowmobiles and ice fishermen. There was still a bit of open water today. I had the park virtually to myself, seeing only a handful of other people.</p>\n<p><img title=\"IMG_1832.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/3b25595fde.png\" alt=\"IMG 1832\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>For over a century people have visited these woods and scenes like this. </p>\n<p>At the east end of the lakes is the former site of the original great hotel of the Catskills, the Catskill Mountain house. The original drive to the site remains as well as remnants of the gates and assorted out buildings</p>\n<p><img title=\"IMG_1842.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/67ca4ecef6.png\" alt=\"IMG 1842\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p><img title=\"IMG_1840.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/5e169c671d.png\" alt=\"IMG 1840\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Guests would arrive up this road to the hotel situated on a cliff overlooking the Hudson Valley. The hotel stood for 140 years before becoming a hazard and being removed with a controlled burn by the DEC in 1963.</p>\n<p>At the former hotel site, there are several displays that show what it looked like along with images of the other nearby hotels.</p>\n<p><img title=\"IMG_1846.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/a18cdeb9eb.png\" alt=\"IMG 1846\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It’s possible to visit a few hotel sites in this region and back in the woods a bit to the west of the Mountain House is the site of the Kaaterskill Hotel. That hotel is also long gone but the area still shows the old roads and foundations where it stood.</p>\n<p><img title=\"IMG_1824.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/b106391c55.png\" alt=\"IMG 1824\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It’s always great to see the woods transformed by the first snows. At some point our winters tend to overstay their welcome but in the early season it’s great to get out and just walk in the snow.</p>\n<p><img title=\"Screenshot 2022-12-11 at 5.20.23 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/d034419869.png\" alt=\"Screenshot 2022 12 11 at 5 20 23 PM\" width=\"600\" height=\"417\" border=\"0\" /></p>\n<p>Todays walk was mostly flat gaining only 470 feet over 7.9 miles of walking. It was about 28º and snowing the entire time.</p>\n<p>For an idea of how many times I’ve visited North Lake here is my GPS tracks for just the past two years. At this point I’ve covered all but a few miles of the trails in the region and many I’ve walked several times.<img title=\"Screenshot 2022-12-11 at 5.23.08 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/26e01e0003.png\" alt=\"Screenshot 2022 12 11 at 5 23 08 PM\" width=\"599\" height=\"430\" border=\"0\" /> </p>\n",
				"date_published": "2022-12-11T18:33:26-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/11/my-own-personal.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/10/making-some-soup.html",
				
				"content_html": "<p>Making some soup and had a thought about also baking a loaf of bread. Google &lsquo;simple bread recipe&rsquo; get a bunch of links to videos over 2 hours long. Decidedly not simple. Soup and whiskey it is.</p>\n",
				"content_text": "Making some soup and had a thought about also baking a loaf of bread. Google 'simple bread recipe' get a bunch of links to videos over 2 hours long. Decidedly not simple. Soup and whiskey it is.\n",
				"date_published": "2022-12-10T19:23:11-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/10/making-some-soup.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/07/the-person-who.html",
				
				"content_html": "<p>The person who moved the delete button in iPadOS mail is a bad person</p>\n",
				"content_text": "The person who moved the delete button in iPadOS mail is a bad person\n",
				"date_published": "2022-12-07T16:42:05-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/07/the-person-who.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/04/roguelike-tutorial-fat.html",
				"title": "Roguelike Tutorial | Fat Old Yeti",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>Playing around with this <a href=\"https://www.fatoldyeti.com/posts/roguelike-tutorial-0/\">Roguelike Tutorial</a>.</p>\n<p><strong><em>tl;dr: it’s very good but I have some mental problems</em></strong></p>\n<p>My OCD immediately kicked in when he added a framework to handle the game systems. I’m not opposed to using a framework but I was hoping to go over how to implement it yourself before taking that shortcut. Not a knock on the tutorial, which is very good, but more a statement about how my mind works and how I can never finish these sorts of projects.</p>\n<p>I’ve built these types of games myself from scratch before and I know how to create all the parts. Sometimes all it takes to scratch that “time to make a game” itch is do a few tutorials and fool around.</p>\n<p>Main reasons I never finish any of these projects are I overcomplicate it from the start and I always want to keep dependencies out of it. These two tend to go hand in hand.</p>\n<p>Sometimes the journey is the point and just reading, learning and messing with the code is the important thing anyway. At least I’ll tell myself that, again.</p>\n<p> </p>\n",
				"date_published": "2022-12-04T14:32:02-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/04/roguelike-tutorial-fat.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/04/burning-off-some.html",
				"title": "Burning Off Some High Octane Egg Nog",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><img title=\"IMG_1801.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/c986817080.png\" alt=\"IMG 1801\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Directly on the Massachusetts border with New York there are an extensive set of trails. Most of them are old roads now used by ATVs and snowmobiles. There are foot trails mixed in and all of it can be hiked. The trails can get wet and muddy due to these vehicles but they allow lots of wandering and creating loops in the woods.</p>\n<p><img title=\"IMG_1809.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/a58702070b.png\" alt=\"IMG 1809\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>In some spots the trails are two lane superhighways through the woods. The location above had two lanes for about a half mile. I assume this is to avoid collisions but in many spots it’s so wet people have created more than two lanes.</p>\n<p><img title=\"IMG_1803.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/4d1be782ad.png\" alt=\"IMG 1803\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The roads and trails create a network of paths but there are quite a lot of signs to help navigate, though they all differ.</p>\n<p><img title=\"IMG_1808.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/2b5beb0bf0.png\" alt=\"IMG 1808\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>One highlight of these woods is Twin Ponds. Two ponds hidden in the woods. The second twin and larger pond is just beyond those trees in the background on that slight rise.<img title=\"IMG_1811.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/026ffe6309.png\" alt=\"IMG 1811\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The trails are intersected at a few points by the <a href=\"https://taconichikingclub.org/taconic-crest-trail\">Taconic Crest Trail</a>. This is more of a footpath and tends to be less wet than the ATV trails. </p>\n<p><img title=\"IMG_1804.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/bda7b58cea.png\" alt=\"IMG 1804\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Today I started off Brickyard Road just off Route 20 but I've accessed this trail network from the parking areas on Route 20 and the Pittsfield side as well. The trails extend for miles and there are many access points. Makes for interesting wandering</p>\n<p>A dreary December day. 31º with a few flurries but still no real snow.</p>\n<p><img title=\"Screenshot 2022-12-04 at 12.55.34 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/d9abc138ad.png\" alt=\"Screenshot 2022 12 04 at 12 55 34 PM\" width=\"274\" height=\"241\" border=\"0\" /><img title=\"Screenshot 2022-12-04 at 12.55.50 PM.png\" src=\"https://pmcconnell.micro.blog/uploads/2022/9368627973.png\" alt=\"Screenshot 2022 12 04 at 12 55 50 PM\" width=\"247\" height=\"503\" border=\"0\" /></p>\n",
				"date_published": "2022-12-04T14:07:47-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/04/burning-off-some.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/02/more-of-this.html",
				
				"content_html": "<p>More of this, please: <a href=\"https://www.reuters.com/technology/activision-blizzard-game-testers-vote-form-union-2022-12-02/\">www.reuters.com/technolog&hellip;</a></p>\n",
				"content_text": "More of this, please: [www.reuters.com/technolog...](https://www.reuters.com/technology/activision-blizzard-game-testers-vote-form-union-2022-12-02/)\n",
				"date_published": "2022-12-02T17:59:16-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/02/more-of-this.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/12/02/the-cycle-goes.html",
				
				"content_html": "<p>The cycle goes like this: play a bunch of games, get bored with those games, decide to create a game, get 20-80% thru creating a game,  unable to just keep game simple, decide it’s easier to just play some games. Repeat.</p>\n<p>Currently in &ldquo;decide to create&rdquo; phase.</p>\n",
				"content_text": "The cycle goes like this: play a bunch of games, get bored with those games, decide to create a game, get 20-80% thru creating a game,  unable to just keep game simple, decide it’s easier to just play some games. Repeat. \n\nCurrently in \"decide to create\" phase. \n",
				"date_published": "2022-12-02T09:41:09-04:00",
				"url": "https://pmcconnell.micro.blog/2022/12/02/the-cycle-goes.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/30/since-i-pointed.html",
				
				"content_html": "<p>Since I pointed out this was broken, I feel inclined to mention searching for Mastodon users in the M.b app is working now</p>\n",
				"content_text": "Since I pointed out this was broken, I feel inclined to mention searching for Mastodon users in the M.b app is working now\n",
				"date_published": "2022-11-30T18:48:48-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/30/since-i-pointed.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/30/several-crashes-of.html",
				
				"content_html": "<p>Several crashes of the Window Server on Mac OS Ventura when connected to an external display. Seems related to use of full screen windows. Seeing reports of this being fixed in the betas so let&rsquo;s get that wrapped up so I don&rsquo;t need to change my workflow</p>\n",
				"content_text": "Several crashes of the Window Server on Mac OS Ventura when connected to an external display. Seems related to use of full screen windows. Seeing reports of this being fixed in the betas so let's get that wrapped up so I don't need to change my workflow\n",
				"date_published": "2022-11-30T12:32:35-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/30/several-crashes-of.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/28/when-the-conditions.html",
				
				"content_html": "<p>When the conditions aren&rsquo;t great for skiing you take a hike to view the mountain from afar. Mount Snow from Somerset Reservoir</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "When the conditions aren't great for skiing you take a hike to view the mountain from afar. Mount Snow from Somerset Reservoir\n\n<img src=\"uploads/2022/62187e459d.png\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2022-11-28T09:24:22-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/28/when-the-conditions.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/22/may-have-sumbled.html",
				
				"content_html": "<p>May have sumbled into something as troubling for developers as dealing with time - capitalization of surnames.  Wish me luck</p>\n",
				"content_text": "May have sumbled into something as troubling for developers as dealing with time - capitalization of surnames.  Wish me luck\n",
				"date_published": "2022-11-22T10:23:16-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/22/may-have-sumbled.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/22/twitter-will-finally.html",
				
				"content_html": "<p>Twitter will finally be dead when the last person posts the last wordle screenshot</p>\n",
				"content_text": "Twitter will finally be dead when the last person posts the last wordle screenshot\n",
				"date_published": "2022-11-22T09:04:29-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/22/twitter-will-finally.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/20/if-you-are.html",
				
				"content_html": "<p>If you are trying to follow Mastdon people through Micro.blog searching for them via discover does not work on the iOS app. It will always return zero results. The same search via the Micro.blog web page will work.</p>\n",
				"content_text": "If you are trying to follow Mastdon people through Micro.blog searching for them via discover does not work on the iOS app. It will always return zero results. The same search via the Micro.blog web page will work. \n",
				"date_published": "2022-11-20T12:47:53-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/20/if-you-are.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/18/ive-often-said.html",
				
				"content_html": "<p>I&rsquo;ve often said the best code is the code you delete. I think overly clever code is not ideal. So what are you presenting for the madmans code show &amp; tell?</p>\n",
				"content_text": "I've often said the best code is the code you delete. I think overly clever code is not ideal. So what are you presenting for the madmans code show & tell?\n",
				"date_published": "2022-11-18T15:39:10-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/18/ive-often-said.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/18/microblog-as-front.html",
				"title": "Micro.blog as front end to Mastodon",
				"content_html": "<p>Here is what I&rsquo;ve figured out regarding Micro.blog and Mastodon. This was confusing to me so maybe this helps others.</p>\n<p>There are two ways to connect your Micro.blog account to Mastodon:</p>\n<p><strong>Option 1</strong> - If you don&rsquo;t already have a Mastodon account:</p>\n<p>On Micro.blog, go to your account settings and find the option for a new ActivtyPub account. Follow the steps to hook it up and your micro.blog timeline will be sent to that newly created Mastodon account.</p>\n<p><strong>Option 2</strong> - You already have a Mastodon account:</p>\n<p>You want to cross post in this case. Go to your Micro.blog account settings and find the button to <em>edit feeds &amp; cross posting</em>. Connect Mastodon (or twitter, etc) to your existing account. Once this is done your micro.blog posts will go to the account(s) you connected.</p>\n<p>I did both but what I really wanted was <em>Option 2</em>. I already have an account with a few followers and telling people to follow you across several accounts is not ideal.</p>\n<p>Micro.blog, once configured will allow you to follow your Mastodon friends right in your timeline. At least I&rsquo;ve been able to add a few so far.</p>\n<p>The only hurdle I encountered with Option 2 was Mastodon timing out several times while trying to approve access from micro.blog. It did eventually work and hopefully this all gets better once the great exodus is over.</p>\n<p>Happy to be shown what I&rsquo;m still doing wrong but this seems to work.</p>\n",
				"content_text": "Here is what I've figured out regarding Micro.blog and Mastodon. This was confusing to me so maybe this helps others. \n\nThere are two ways to connect your Micro.blog account to Mastodon:\n\n**Option 1** - If you don't already have a Mastodon account: \n\nOn Micro.blog, go to your account settings and find the option for a new ActivtyPub account. Follow the steps to hook it up and your micro.blog timeline will be sent to that newly created Mastodon account.\n\n**Option 2** - You already have a Mastodon account:\n\nYou want to cross post in this case. Go to your Micro.blog account settings and find the button to _edit feeds & cross posting_. Connect Mastodon (or twitter, etc) to your existing account. Once this is done your micro.blog posts will go to the account(s) you connected. \n\nI did both but what I really wanted was _Option 2_. I already have an account with a few followers and telling people to follow you across several accounts is not ideal.\n\nMicro.blog, once configured will allow you to follow your Mastodon friends right in your timeline. At least I've been able to add a few so far.\n\nThe only hurdle I encountered with Option 2 was Mastodon timing out several times while trying to approve access from micro.blog. It did eventually work and hopefully this all gets better once the great exodus is over.\n\nHappy to be shown what I'm still doing wrong but this seems to work.\n",
				"date_published": "2022-11-18T15:35:37-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/18/microblog-as-front.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/18/i-may-have.html",
				
				"content_html": "<p>I <em>may</em> have cracked the code to get micro.blog working as the front end to my mastodon feed.</p>\n",
				"content_text": "I _may_ have cracked the code to get micro.blog working as the front end to my mastodon feed. \n",
				"date_published": "2022-11-18T14:46:10-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/18/i-may-have.html",
				"tags": ["Geekery"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/18/feels-like-you.html",
				
				"content_html": "<p>Feels like you can judge how bad things are going over on twitter by how much mastodon slows down with the weight of new users. None of which is ideal.</p>\n",
				"content_text": "Feels like you can judge how bad things are going over on twitter by how much mastodon slows down with the weight of new users. None of which is ideal. \n",
				"date_published": "2022-11-18T07:53:52-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/18/feels-like-you.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/16/not-certain-how.html",
				
				"content_html": "<p>Not certain how I feel about this</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Not certain how I feel about this\n\n<img src=\"uploads/2022/50dc505697.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-11-16T08:13:42-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/16/not-certain-how.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/15/i-was-enjoying.html",
				
				"content_html": "<p>I was enjoying fall a lot more when it wasn&rsquo;t 23º</p>\n",
				"content_text": "I was enjoying fall a lot more when it wasn't 23º\n",
				"date_published": "2022-11-15T10:48:43-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/15/i-was-enjoying.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/13/160650.html",
				"title": "November beginning to feel like November ",
				"content_html": "<p>Headed down to the Taconic Ridge south of Great Barrington for some quality time in the woods.</p>\n<!-- raw HTML omitted -->\n<p>Rain yesterday made for some mud but the streams looked nice.</p>\n<!-- raw HTML omitted -->\n<p>Some tricky crossings but no falls.</p>\n<!-- raw HTML omitted -->\n<p>I&rsquo;ve been aware of this free primative camp area for a while but never bothered to walk through it. will need to come back for an overnight.</p>\n<!-- raw HTML omitted -->\n<p>The leaves are all down now and some spots were quite slick</p>\n<!-- raw HTML omitted -->\n<p>4.5 miles of easy walking. About 900' of elevation gain.</p>\n<p><a href=\"https://maps.apple.com/?ll=42.086486,-73.462122&amp;q=Mount%20Washington%20Park%20HQ&amp;t=m\">Trailhead parking at Mount Washington Park Headquarters</a></p>\n",
				"content_text": "Headed down to the Taconic Ridge south of Great Barrington for some quality time in the woods. \n\n<img src=\"https://pmcconnell-test.micro.blog/uploads/2022/047de29076.jpg\" width=\"600\" height=\"450\" alt=\"\">\n\nRain yesterday made for some mud but the streams looked nice.\n\n<img src=\"https://pmcconnell-test.micro.blog/uploads/2022/41490f62f8.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n\nSome tricky crossings but no falls.\n\n<img src=\"https://pmcconnell-test.micro.blog/uploads/2022/79a8ea3653.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n\nI've been aware of this free primative camp area for a while but never bothered to walk through it. will need to come back for an overnight. \n\n<img src=\"https://pmcconnell-test.micro.blog/uploads/2022/155e9e361e.jpg\" width=\"600\" height=\"450\" alt=\"\" />\n\nThe leaves are all down now and some spots were quite slick\n\n<img src=\"https://pmcconnell-test.micro.blog/uploads/2022/8075a08f22.jpg\" width=\"600\" height=\"478\" alt=\"\" />\n\n4.5 miles of easy walking. About 900' of elevation gain. \n\n[Trailhead parking at Mount Washington Park Headquarters](https://maps.apple.com/?ll=42.086486,-73.462122&q=Mount%20Washington%20Park%20HQ&t=m)\n",
				"date_published": "2022-11-13T17:08:21-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/13/160650.html",
				"tags": ["Woods"]
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/12/changing-social-apps.html",
				
				"content_html": "<p>Changing social apps feels like you showed up at the wrong address for the party. Where is everyone?</p>\n",
				"content_text": "Changing social apps feels like you showed up at the wrong address for the party. Where is everyone?\n",
				"date_published": "2022-11-12T19:23:09-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/12/changing-social-apps.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/12/microblog-will-backup.html",
				
				"content_html": "<p>Microblog will backup to GitHub. Now my useless posts will be saved</p>\n",
				"content_text": "Microblog will backup to GitHub. Now my useless posts will be saved\n",
				"date_published": "2022-11-12T19:04:28-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/12/microblog-will-backup.html"
			},
			{
				"id": "http://pmcconnell.micro.blog/2022/11/12/time-to-see.html",
				
				"content_html": "<p>Time to see what this 5 year old account can do. I like the features of micro blog. Even does mastodon so i can hang the cool kids.</p>\n",
				"content_text": "Time to see what this 5 year old account can do. I like the features of micro blog. Even does mastodon so i can hang the cool kids.  \n",
				"date_published": "2022-11-12T18:42:29-04:00",
				"url": "https://pmcconnell.micro.blog/2022/11/12/time-to-see.html"
			}
	]
}
